// pages/look/hongmen/hongmen.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: [{
      id: 'view',
      name: '红门浏览线——初登者推荐路线',
      open: false,
      describe:'红门游览线是古今最主要的登山旅游路线，是历朝皇帝的登山御道。沿途林荫夹道，石阶盘旋，峰峦竟秀，泉溪争流，自然景观雄奇秀美，古迹众多，传统文化韵味浓郁。又因为这条道路景色深幽，所以也被称为泰山的“幽区”。',
      path:'有岱宗坊、一天门、孔子登临处、红门宫、万仙楼、革命烈士纪念碑、斗母宫、元君庙、经石峪、回马岭、中天门、云步桥、五大夫松、朝阳洞、十八盘、升仙坊、南天门等',
      method:'1、该路线为徒步浏览路线，全程9.5公里，其间几无平路。\n2、在泰山火车站下车后，可乘坐3路公交车至红门；在泰安高铁站下车后，可乘坐37路公交车至红门，或乘坐61路“高铁泰安站-泰山景区”旅游专线直通车直达红门登山起点处。'
    },]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})