// pages/introduce/introduce.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: [{
      id: 'view',
      name: '泰山伴旅使用说明',
      open: false,
      main:'首页主要是介绍了天气情况、泰山图片以及热门景点的图片，点击天气预报处可以查看当天的天气以及近七天的天气预报。',
      look:'在景点预览页面可以查看泰山重要景点的景点信息和路线信息。\n点击景点对应的小圆圈处可以查看景点信息。\n点击左上方小精灵会弹出三个按钮，点击查看对应的推荐路线信息。',
      help:'左上角和右上角分别实时显示当前位置的海拔和距山顶（玉皇顶）的距离。\n点击右下方定位图标可以一键定位到自己。\n页面右侧有景点和各种便利设施图标，点击可以查看标注的地点位置。点击某一标注地点可以查看地点图片和地点位置信息。',
      path:'第一次使用旅行足迹页面会弹出帮助页面，显示详细使用说明。在本页面，点击灰色小桃花并授权用户信息后可以上传在当前景点的游览图片，上传成功后灰色桃花会被渲染为彩色，当点亮全部小桃花后，整个地图会被渲染为彩色。'
    },]

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})